---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
LayerModifier Properties
LayerModifier Class See Also Send Feedback
---

The LayerModifier type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ModifierType | The modifier type of LayerModifier. |
|  | Separator | The separator string that will follow this modifier in the export layer name. |

# See Also

LayerModifier Class

Autodesk.Revit.DB Namespace